# TableMergedCell Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableMergedCell Members
TableMergedCell Class Constructors Methods Properties See Also
---
The TableMergedCell type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TableMergedCell()()()() | Default constructor. |
| TableMergedCell(Int32, Int32, Int32, Int32) | Constructor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TableMergedCell |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Bottom | Specifies the row index of the bottom-right corner of a table grid. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Left | Specifies the column index of the top-left corner of a table grid. |
| Right | Specifies the column index of the bottom-right corner of a table grid. |
| Top | Specifies the row index of the top-left corner of a table grid. |

# See Also
TableMergedCell Class
Autodesk.Revit.DB Namespace